makerdiary/nrf52840-mdk/examples/nrf5-sdk/ble_app_rscs/main.c
#define MIN_STRIDE_LENGTH               20                                      /**< Minimum stride length in decimeter for use in the simulated measurement function. */
#define MAX_STRIDE_LENGTH               125                                     /**< Maximum stride length in decimeter for use in the simulated measurement function. */
#define STRIDE_LENGTH_INCREMENT         5                                       /**< Value by which stride length is incremented/decremented in the simulated measurement function. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(500, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(1000, UNIT_1_25_MS)       /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */

/**
 * @defgroup ble_dis_config Configuration for Device Information Service.
 * @brief Example characteristic values used for Device Information Service. Will be passed to Device Information Service.
 * @{
 */
#define BLE_DIS_MANUFACTURER_NAME       "NordicSemiconductor"                   /**< Manufacturer Name String. */
#define BLE_DIS_MODEL_NUMBER            "NRF5X"                                 /**< Model Number String. */
#define BLE_DIS_SERIAL_NUMBER           "T0139836"                              /**< Serial Number String. */
#define BLE_DIS_HW_REVISION             "2016.42"                               /**< Hardware Revision String. */
#define BLE_DIS_FW_REVISION             "0.1.2"                                 /**< Firmware Revision String. */
#define BLE_DIS_SW_REVISION             "1.2.3"                                 /**< Software Revision String. */
#define BLE_DIS_MANUFACTURER_ID         0x0000000059                            /**< Manufacturer ID for System ID. */
#define BLE_DIS_OU_ID                   0x123456                                /**< Organizationally unique ID for System ID. */
#define BLE_DIS_CERT_LIST               {0x00, 0x01, 0x02, 0x03}                /**< IEEE 11073-20601 Regulatory Certification Data List. */
#define BLE_DIS_VENDOR_ID               0x0059                                  /**< Vendor ID for PnP ID. */
#define BLE_DIS_PRODUCT_ID              0x0001                                  /**< Product ID for PnP ID. */
#define BLE_DIS_PRODUCT_VERSION         0x0002                                  /**< Product Version for PnP ID. */
/** @} */

APP_TIMER_DEF(m_battery_timer_id);                                              /**< Battery timer. */
APP_TIMER_DEF(m_rsc_meas_timer_id);                                             /**< RSC measurement timer. */
BLE_BAS_DEF(m_bas);                                                             /**< Structure used to identify the battery service. */
BLE_RSCS_DEF(m_rscs);                                                           /**< Structure used to identify the running speed and cadence service. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

static uint16_t          m_conn_handle = BLE_CONN_HANDLE_INVALID;               /**< Handle of the current connection. */

static sensorsim_cfg_t   m_battery_sim_cfg;                                     /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                                   /**< Battery Level sensor simulator state. */

static sensorsim_cfg_t   m_speed_mps_sim_cfg;                                   /**< Speed simulator configuration. */
static sensorsim_state_t m_speed_mps_sim_state;                                 /**< Speed simulator state. */
static sensorsim_cfg_t   m_cadence_rpm_sim_cfg;                                 /**< Cadence simulator configuration. */
static sensorsim_state_t m_cadence_rpm_sim_state;                               /**< Cadence simulator state. */
static sensorsim_cfg_t   m_cadence_stl_sim_cfg;                                 /**< stride length simulator configuration. */
static sensorsim_state_t m_cadence_stl_sim_state;                               /**< stride length simulator state. */

static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {BLE_UUID_RUNNING_SPEED_AND_CADENCE,    BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE,              BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE,   BLE_UUID_TYPE_BLE}
};


static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


